; ModuleID = 'test-files/example4.c'
source_filename = "test-files/example4.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [67 x i8] c"Enter option (1: processData, 2: compareInts, 3: fileOperations): \00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"test.txt\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.4 = private unnamed_addr constant [25 x i8] c"Failed to open test file\00", align 1
@.str.5 = private unnamed_addr constant [29 x i8] c"Enter number of iterations: \00", align 1
@.str.6 = private unnamed_addr constant [32 x i8] c"Enter two integers to compare: \00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"%d %d\00", align 1
@.str.8 = private unnamed_addr constant [60 x i8] c"Enter comparator type (A for ascending, D for descending): \00", align 1
@.str.9 = private unnamed_addr constant [4 x i8] c" %c\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "test-files/example4.c", directory: "/home/mhpatel4/repos/llvm-project", checksumkind: CSK_MD5, checksum: "18a8837568accab264b51b8bd1ea2582")
!2 = !{!3, !4}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !{i32 7, !"Dwarf Version", i32 5}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{i32 7, !"PIC Level", i32 2}
!10 = !{i32 7, !"PIE Level", i32 2}
!11 = !{i32 7, !"uwtable", i32 1}
!12 = !{i32 7, !"frame-pointer", i32 2}
!13 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!14 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 11, type: !15, scopeLine: 11, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !18)
!15 = !DISubroutineType(types: !16)
!16 = !{!17}
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !{}
!19 = !DILocalVariable(name: "option", scope: !14, file: !1, line: 12, type: !17)
!20 = !DILocation(line: 12, column: 9, scope: !14)
!21 = !DILocalVariable(name: "num", scope: !14, file: !1, line: 12, type: !17)
!22 = !DILocation(line: 12, column: 17, scope: !14)
!23 = !DILocalVariable(name: "a", scope: !14, file: !1, line: 12, type: !17)
!24 = !DILocation(line: 12, column: 22, scope: !14)
!25 = !DILocalVariable(name: "b", scope: !14, file: !1, line: 12, type: !17)
!26 = !DILocation(line: 12, column: 25, scope: !14)
!27 = !DILocalVariable(name: "buffer", scope: !14, file: !1, line: 13, type: !28)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 800, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 100)
!31 = !DILocation(line: 13, column: 10, scope: !14)
!32 = !DILocalVariable(name: "type", scope: !14, file: !1, line: 13, type: !5)
!33 = !DILocation(line: 13, column: 23, scope: !14)
!34 = !DILocalVariable(name: "fp", scope: !14, file: !1, line: 14, type: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !37, line: 7, baseType: !38)
!37 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !39, line: 49, size: 1728, elements: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !56, !58, !59, !60, !64, !66, !68, !72, !75, !77, !80, !83, !84, !85, !89, !90}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !38, file: !39, line: 51, baseType: !17, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !38, file: !39, line: 54, baseType: !4, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !38, file: !39, line: 55, baseType: !4, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !38, file: !39, line: 56, baseType: !4, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !38, file: !39, line: 57, baseType: !4, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !38, file: !39, line: 58, baseType: !4, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !38, file: !39, line: 59, baseType: !4, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !38, file: !39, line: 60, baseType: !4, size: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !38, file: !39, line: 61, baseType: !4, size: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !38, file: !39, line: 64, baseType: !4, size: 64, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !38, file: !39, line: 65, baseType: !4, size: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !38, file: !39, line: 66, baseType: !4, size: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !38, file: !39, line: 68, baseType: !54, size: 64, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !39, line: 36, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !38, file: !39, line: 70, baseType: !57, size: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !38, file: !39, line: 72, baseType: !17, size: 32, offset: 896)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !38, file: !39, line: 73, baseType: !17, size: 32, offset: 928)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !38, file: !39, line: 74, baseType: !61, size: 64, offset: 960)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !62, line: 152, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!63 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !38, file: !39, line: 77, baseType: !65, size: 16, offset: 1024)
!65 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !38, file: !39, line: 78, baseType: !67, size: 8, offset: 1040)
!67 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !38, file: !39, line: 79, baseType: !69, size: 8, offset: 1048)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !38, file: !39, line: 81, baseType: !73, size: 64, offset: 1088)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !39, line: 43, baseType: null)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !38, file: !39, line: 89, baseType: !76, size: 64, offset: 1152)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !62, line: 153, baseType: !63)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !38, file: !39, line: 91, baseType: !78, size: 64, offset: 1216)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !39, line: 37, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !38, file: !39, line: 92, baseType: !81, size: 64, offset: 1280)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !39, line: 38, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !38, file: !39, line: 93, baseType: !57, size: 64, offset: 1344)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !38, file: !39, line: 94, baseType: !3, size: 64, offset: 1408)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !38, file: !39, line: 95, baseType: !86, size: 64, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 46, baseType: !88)
!87 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!88 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !38, file: !39, line: 96, baseType: !17, size: 32, offset: 1536)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !38, file: !39, line: 98, baseType: !91, size: 160, offset: 1568)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 20)
!94 = !DILocation(line: 14, column: 11, scope: !14)
!95 = !DILocation(line: 17, column: 5, scope: !14)
!96 = !DILocation(line: 18, column: 5, scope: !14)
!97 = !DILocation(line: 21, column: 10, scope: !14)
!98 = !DILocation(line: 21, column: 8, scope: !14)
!99 = !DILocation(line: 22, column: 9, scope: !100)
!100 = distinct !DILexicalBlock(scope: !14, file: !1, line: 22, column: 9)
!101 = !DILocation(line: 22, column: 12, scope: !100)
!102 = !DILocation(line: 22, column: 9, scope: !14)
!103 = !DILocation(line: 23, column: 9, scope: !104)
!104 = distinct !DILexicalBlock(scope: !100, file: !1, line: 22, column: 21)
!105 = !DILocation(line: 24, column: 9, scope: !104)
!106 = !DILocation(line: 28, column: 9, scope: !107)
!107 = distinct !DILexicalBlock(scope: !14, file: !1, line: 28, column: 9)
!108 = !DILocation(line: 28, column: 16, scope: !107)
!109 = !DILocation(line: 28, column: 9, scope: !14)
!110 = !DILocation(line: 29, column: 9, scope: !111)
!111 = distinct !DILexicalBlock(scope: !107, file: !1, line: 28, column: 22)
!112 = !DILocation(line: 30, column: 9, scope: !111)
!113 = !DILocation(line: 31, column: 21, scope: !111)
!114 = !DILocation(line: 31, column: 9, scope: !111)
!115 = !DILocation(line: 32, column: 5, scope: !111)
!116 = !DILocation(line: 32, column: 16, scope: !117)
!117 = distinct !DILexicalBlock(scope: !107, file: !1, line: 32, column: 16)
!118 = !DILocation(line: 32, column: 23, scope: !117)
!119 = !DILocation(line: 32, column: 16, scope: !107)
!120 = !DILocation(line: 33, column: 9, scope: !121)
!121 = distinct !DILexicalBlock(scope: !117, file: !1, line: 32, column: 29)
!122 = !DILocation(line: 34, column: 9, scope: !121)
!123 = !DILocation(line: 36, column: 9, scope: !121)
!124 = !DILocation(line: 37, column: 9, scope: !121)
!125 = !DILocalVariable(name: "cmp", scope: !121, file: !1, line: 39, type: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!17, !17, !17}
!129 = !DILocation(line: 39, column: 15, scope: !121)
!130 = !DILocation(line: 39, column: 46, scope: !121)
!131 = !DILocation(line: 39, column: 32, scope: !121)
!132 = !DILocation(line: 40, column: 13, scope: !133)
!133 = distinct !DILexicalBlock(scope: !121, file: !1, line: 40, column: 13)
!134 = !DILocation(line: 40, column: 17, scope: !133)
!135 = !DILocation(line: 40, column: 13, scope: !121)
!136 = !DILocalVariable(name: "result", scope: !137, file: !1, line: 41, type: !17)
!137 = distinct !DILexicalBlock(scope: !133, file: !1, line: 40, column: 26)
!138 = !DILocation(line: 41, column: 17, scope: !137)
!139 = !DILocation(line: 41, column: 26, scope: !137)
!140 = !DILocation(line: 41, column: 30, scope: !137)
!141 = !DILocation(line: 41, column: 33, scope: !137)
!142 = !DILocation(line: 42, column: 47, scope: !137)
!143 = !DILocation(line: 42, column: 13, scope: !137)
!144 = !DILocation(line: 43, column: 9, scope: !137)
!145 = !DILocation(line: 44, column: 13, scope: !146)
!146 = distinct !DILexicalBlock(scope: !133, file: !1, line: 43, column: 16)
!147 = !DILocation(line: 46, column: 5, scope: !121)
!148 = !DILocation(line: 46, column: 16, scope: !149)
!149 = distinct !DILexicalBlock(scope: !117, file: !1, line: 46, column: 16)
!150 = !DILocation(line: 46, column: 23, scope: !149)
!151 = !DILocation(line: 46, column: 16, scope: !117)
!152 = !DILocation(line: 47, column: 9, scope: !153)
!153 = distinct !DILexicalBlock(scope: !149, file: !1, line: 46, column: 29)
!154 = !DILocation(line: 48, column: 5, scope: !153)
!155 = !DILocation(line: 49, column: 9, scope: !156)
!156 = distinct !DILexicalBlock(scope: !149, file: !1, line: 48, column: 12)
!157 = !DILocation(line: 52, column: 12, scope: !14)
