; ModuleID = 'test-files/example5.c'
source_filename = "test-files/example5.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [48 x i8] c"Enter option (1: processData, 2: compareInts): \00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"input.txt\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.4 = private unnamed_addr constant [26 x i8] c"Failed to open input file\00", align 1
@.str.5 = private unnamed_addr constant [11 x i8] c"output.txt\00", align 1
@.str.6 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.7 = private unnamed_addr constant [27 x i8] c"Failed to open output file\00", align 1
@.str.8 = private unnamed_addr constant [13 x i8] c"Empty file.\0A\00", align 1
@.str.9 = private unnamed_addr constant [21 x i8] c"First character: %c\0A\00", align 1
@.str.10 = private unnamed_addr constant [30 x i8] c"File content (%ld bytes): %s\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "test-files/example5.c", directory: "/home/mhpatel4/repos/llvm-project", checksumkind: CSK_MD5, checksum: "858a477577d362ab1d3595c073c16b46")
!2 = !{!3, !4}
!3 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!6 = !{i32 7, !"Dwarf Version", i32 5}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{i32 7, !"PIC Level", i32 2}
!10 = !{i32 7, !"PIE Level", i32 2}
!11 = !{i32 7, !"uwtable", i32 1}
!12 = !{i32 7, !"frame-pointer", i32 2}
!13 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!14 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 10, type: !15, scopeLine: 10, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !18)
!15 = !DISubroutineType(types: !16)
!16 = !{!17}
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !{}
!19 = !DILocalVariable(name: "option", scope: !14, file: !1, line: 11, type: !17)
!20 = !DILocation(line: 11, column: 9, scope: !14)
!21 = !DILocalVariable(name: "buffer", scope: !14, file: !1, line: 12, type: !22)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 800, elements: !23)
!23 = !{!24}
!24 = !DISubrange(count: 100)
!25 = !DILocation(line: 12, column: 10, scope: !14)
!26 = !DILocalVariable(name: "fp", scope: !14, file: !1, line: 13, type: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !29, line: 7, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !31, line: 49, size: 1728, elements: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !48, !50, !51, !52, !56, !58, !60, !64, !67, !69, !72, !75, !76, !77, !81, !82}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !30, file: !31, line: 51, baseType: !17, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !30, file: !31, line: 54, baseType: !4, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !30, file: !31, line: 55, baseType: !4, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !30, file: !31, line: 56, baseType: !4, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !30, file: !31, line: 57, baseType: !4, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !30, file: !31, line: 58, baseType: !4, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !30, file: !31, line: 59, baseType: !4, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !30, file: !31, line: 60, baseType: !4, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !30, file: !31, line: 61, baseType: !4, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !30, file: !31, line: 64, baseType: !4, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !30, file: !31, line: 65, baseType: !4, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !30, file: !31, line: 66, baseType: !4, size: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !30, file: !31, line: 68, baseType: !46, size: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !31, line: 36, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !30, file: !31, line: 70, baseType: !49, size: 64, offset: 832)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !30, file: !31, line: 72, baseType: !17, size: 32, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !30, file: !31, line: 73, baseType: !17, size: 32, offset: 928)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !30, file: !31, line: 74, baseType: !53, size: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 152, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!55 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !30, file: !31, line: 77, baseType: !57, size: 16, offset: 1024)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !30, file: !31, line: 78, baseType: !59, size: 8, offset: 1040)
!59 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !30, file: !31, line: 79, baseType: !61, size: 8, offset: 1048)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 1)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !30, file: !31, line: 81, baseType: !65, size: 64, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !31, line: 43, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !30, file: !31, line: 89, baseType: !68, size: 64, offset: 1152)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 153, baseType: !55)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !30, file: !31, line: 91, baseType: !70, size: 64, offset: 1216)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !31, line: 37, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !30, file: !31, line: 92, baseType: !73, size: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !31, line: 38, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !30, file: !31, line: 93, baseType: !49, size: 64, offset: 1344)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !30, file: !31, line: 94, baseType: !3, size: 64, offset: 1408)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !30, file: !31, line: 95, baseType: !78, size: 64, offset: 1472)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 46, baseType: !80)
!79 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!80 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !30, file: !31, line: 96, baseType: !17, size: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !30, file: !31, line: 98, baseType: !83, size: 160, offset: 1568)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 20)
!86 = !DILocation(line: 13, column: 11, scope: !14)
!87 = !DILocalVariable(name: "outputFile", scope: !14, file: !1, line: 13, type: !27)
!88 = !DILocation(line: 13, column: 16, scope: !14)
!89 = !DILocation(line: 16, column: 5, scope: !14)
!90 = !DILocation(line: 17, column: 5, scope: !14)
!91 = !DILocation(line: 20, column: 10, scope: !14)
!92 = !DILocation(line: 20, column: 8, scope: !14)
!93 = !DILocation(line: 21, column: 9, scope: !94)
!94 = distinct !DILexicalBlock(scope: !14, file: !1, line: 21, column: 9)
!95 = !DILocation(line: 21, column: 12, scope: !94)
!96 = !DILocation(line: 21, column: 9, scope: !14)
!97 = !DILocation(line: 22, column: 9, scope: !98)
!98 = distinct !DILexicalBlock(scope: !94, file: !1, line: 21, column: 21)
!99 = !DILocation(line: 23, column: 9, scope: !98)
!100 = !DILocation(line: 27, column: 18, scope: !14)
!101 = !DILocation(line: 27, column: 16, scope: !14)
!102 = !DILocation(line: 28, column: 9, scope: !103)
!103 = distinct !DILexicalBlock(scope: !14, file: !1, line: 28, column: 9)
!104 = !DILocation(line: 28, column: 20, scope: !103)
!105 = !DILocation(line: 28, column: 9, scope: !14)
!106 = !DILocation(line: 29, column: 9, scope: !107)
!107 = distinct !DILexicalBlock(scope: !103, file: !1, line: 28, column: 29)
!108 = !DILocation(line: 30, column: 16, scope: !107)
!109 = !DILocation(line: 30, column: 9, scope: !107)
!110 = !DILocation(line: 31, column: 9, scope: !107)
!111 = !DILocalVariable(name: "ch", scope: !14, file: !1, line: 35, type: !5)
!112 = !DILocation(line: 35, column: 10, scope: !14)
!113 = !DILocation(line: 35, column: 20, scope: !14)
!114 = !DILocation(line: 35, column: 15, scope: !14)
!115 = !DILocation(line: 36, column: 9, scope: !116)
!116 = distinct !DILexicalBlock(scope: !14, file: !1, line: 36, column: 9)
!117 = !DILocation(line: 36, column: 12, scope: !116)
!118 = !DILocation(line: 36, column: 9, scope: !14)
!119 = !DILocation(line: 37, column: 17, scope: !120)
!120 = distinct !DILexicalBlock(scope: !116, file: !1, line: 36, column: 20)
!121 = !DILocation(line: 37, column: 9, scope: !120)
!122 = !DILocation(line: 38, column: 5, scope: !120)
!123 = !DILocation(line: 39, column: 17, scope: !124)
!124 = distinct !DILexicalBlock(scope: !116, file: !1, line: 38, column: 12)
!125 = !DILocation(line: 39, column: 54, scope: !124)
!126 = !DILocation(line: 39, column: 9, scope: !124)
!127 = !DILocation(line: 43, column: 11, scope: !14)
!128 = !DILocation(line: 43, column: 5, scope: !14)
!129 = !DILocalVariable(name: "fileSize", scope: !14, file: !1, line: 44, type: !55)
!130 = !DILocation(line: 44, column: 10, scope: !14)
!131 = !DILocation(line: 44, column: 27, scope: !14)
!132 = !DILocation(line: 44, column: 21, scope: !14)
!133 = !DILocation(line: 45, column: 11, scope: !14)
!134 = !DILocation(line: 45, column: 5, scope: !14)
!135 = !DILocation(line: 48, column: 9, scope: !136)
!136 = distinct !DILexicalBlock(scope: !14, file: !1, line: 48, column: 9)
!137 = !DILocation(line: 48, column: 18, scope: !136)
!138 = !DILocation(line: 48, column: 9, scope: !14)
!139 = !DILocalVariable(name: "fileContent", scope: !140, file: !1, line: 49, type: !4)
!140 = distinct !DILexicalBlock(scope: !136, file: !1, line: 48, column: 23)
!141 = !DILocation(line: 49, column: 15, scope: !140)
!142 = !DILocation(line: 49, column: 43, scope: !140)
!143 = !DILocation(line: 49, column: 52, scope: !140)
!144 = !DILocation(line: 49, column: 36, scope: !140)
!145 = !DILocalVariable(name: "bytesRead", scope: !140, file: !1, line: 50, type: !78)
!146 = !DILocation(line: 50, column: 16, scope: !140)
!147 = !DILocation(line: 50, column: 34, scope: !140)
!148 = !DILocation(line: 50, column: 61, scope: !140)
!149 = !DILocation(line: 50, column: 71, scope: !140)
